In [3]:
import pandas as pd
import numpy as np

In [4]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [5]:
data.head()

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5

In [8]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [6]:
lowercased = data['food'].str.lower()

In [9]:
data['animal'] = lowercased.map(meat_to_animal)

In [10]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

# Use of lambda functions with mapping

In [11]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [13]:
transform = lambda x:x[:4].upper() # lo que hace es que a cada valor de un iterable le aplica el metodo UPPER a los 4 primeras letras y las devuelve

In [15]:
data.index = data.index.map(transform)

In [16]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

# Use of Rename

In [17]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [19]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [20]:
data.rename(index={'OHIO':'SAINT LOUIS'},inplace=True)

In [21]:
data

             one  two  three  four
SAINT LOUIS    0    1      2     3
COLO           4    5      6     7
NEW            8    9     10    11